In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("Data/iris_missing.csv")
df.head(7)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [3]:
df_na = df.head(7)
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [4]:
df_na['Sepal_Length'].isna().sum()

1

In [5]:
df_na.isna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [6]:
df_na.isna().sum() # 각 변수별 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [7]:
df_na.isna().sum(axis=1) # 각 row별 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [8]:
df_na.fillna(value = {"Sepal_Length": 5,
                     "Sepal_Width": 999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           5.0        999.0           NaN          NaN  setosa

In [9]:
df_na.fillna(value=222)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        222.0         222.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     222
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     222
5           5.4          3.9           1.7          0.4  setosa
6         222.0        222.0         222.0        222.0  setosa

In [10]:
df_na["Sepal_Width"].mean()

3.3600000000000003

In [11]:
df_na = df_na.fillna(value={"Sepal_Width": df_na["Sepal_Width"].mean()})
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1         3.36           NaN          0.2  setosa
1           4.9         3.00           1.4          0.2  setosa
2           4.7         3.20           1.3          0.2     NaN
3           4.6         3.10           1.5          0.2  setosa
4           5.0         3.60           1.4          0.2     NaN
5           5.4         3.90           1.7          0.4  setosa
6           NaN         3.36           NaN          NaN  setosa

In [12]:
df_na2 = df.head(7)
df_na2

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [13]:
df_na.dropna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [14]:
df_na2.dropna(how="all") # 전부 다 결측치인 경우

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [16]:
df_na2.iloc[:, :-1].dropna(how="all")

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [18]:
print(df["Sepal_Length"].max())
print(df["Sepal_Length"].min())
print(df["Sepal_Length"].mean())

7.9
4.3
5.853846153846154

In [19]:
df["Sepal_Length"].median()

5.8

In [20]:
df["Sepal_Length"].quantile()

5.8

In [21]:
print(df["Sepal_Length"].quantile(q = 0.25)) # 제1사분위수
print(df["Sepal_Length"].quantile(q = 0.5)) # 제2사분위수
print(df["Sepal_Length"].quantile(q = 0.75)) # 제3사분위수

5.1
5.8
6.4

In [22]:
df.iloc[:,:-1].isna().sum()

Sepal_Length     7
Sepal_Width     13
Petal_Length    14
Petal_Width      6
dtype: int64

In [23]:
df.iloc[:,:-1].isna().sum().sum()

40

In [24]:
# sepal_width의 결측치를 평균으로 했을시 분산은?
df = df.fillna(value = {"Sepal_Width": df["Sepal_Width"].mean()})
df["Sepal_Width"].var()

0.17561945818840946

In [27]:
# 평균을 기준으로 1.5 표준편차를 넘어서는 값을 이상치라고 간주할 때
# Sepal.Length 변수를 기준으로 이상치인 row 개수는 몇 개인가?
df = pd.read_csv("Data/iris.csv")
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [28]:
sl_mean = df["Sepal.Length"].mean()
sl_std = df["Sepal.Length"].std()
print(sl_mean)
print(sl_std)

5.843333333333335
0.8280661279778629

In [29]:
cond_1 = df["Sepal.Length"] < (sl_mean - 1.5 * sl_std)
cond_2 = df["Sepal.Length"] > (sl_mean + 1.5 * sl_std)
df_out = df.loc[(cond_1) | (cond_2), ]
len(df_out)

21